public class lesson6_tree {
    //TODO
    // 1. Создать и запустить программу для построения двоичного дерева. В цикле построить двадцать деревьев.
    // Данные, которыми необходимо заполнить узлы деревьев, представляются в виде чисел типа int.
    // Число, которое попадает в узел, должно генерироваться случайным образом в диапазоне от -100 до 100
    // 2. Проанализировать, какой процент созданных деревьев являются несбалансированными.
    // 3. * Переписать метод добавления элемента в дерево с использованием компаратора и рекурсивного подхода


}
